src/main/resources/soap-exception-india.xml



<!-- Request -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <getCountryRequest xmlns="http://drmodi.learn.com/model/country">
            <countryCode>in-invalid</countryCode>
        </getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>






<!-- Response -->

<!--

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <SOAP-ENV:Fault>
            <faultcode>SOAP-ENV:Server</faultcode>
            <faultstring xml:lang="en">ERROR</faultstring>
            <detail>
                <code>NOT_FOUND</code>
                <description># in-invalid # being passed as country code in request. Possible Country code values are : {in, us or ch}. Use according country alpha2code!</description>
            </detail>
        </SOAP-ENV:Fault>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

-->